# Analayzing Consumer data using dataset

## importing necessary packages

In [23]:
import pandas as pd
import numpy as np
from datetime import datetime,date,time

In [7]:
new_york = pd.read_csv('/content/dataset_TSMC2014_NYC.csv')
tokyo = pd.read_csv('/content/dataset_TSMC2014_TKY.csv')

In [8]:
new_york.head()

   userId  ...                    utcTimestamp
0     470  ...  Tue Apr 03 18:00:09 +0000 2012
1     979  ...  Tue Apr 03 18:00:25 +0000 2012
2      69  ...  Tue Apr 03 18:02:24 +0000 2012
3     395  ...  Tue Apr 03 18:02:41 +0000 2012
4      87  ...  Tue Apr 03 18:03:00 +0000 2012

[5 rows x 8 columns]

In [10]:
type(new_york['utcTimestamp'][0])

str

In [15]:
def timestampToDateTime(timestamp_list):
  final_timestamp =[]
  for timestamp in timestamp_list:
    split_timestamp = timestamp.split(' ')
    d = {'day_of_week':split_timestamp[0],
         'day':(split_timestamp[2]+' '+split_timestamp[1]+' '+split_timestamp[5]),
         'time':split_timestamp[3]}
    final_timestamp.append(d)
  return final_timestamp
new_coloumns = timestampToDateTime(new_york['utcTimestamp'])

In [16]:
datetimes = pd.DataFrame(new_coloumns)

In [17]:
datetimes.head

  day_of_week          day      time
0         Tue  03 Apr 2012  18:00:09
1         Tue  03 Apr 2012  18:00:25
2         Tue  03 Apr 2012  18:02:24
3         Tue  03 Apr 2012  18:02:41
4         Tue  03 Apr 2012  18:03:00

In [26]:

year = datetimes['day'][0].split(' ')[2]
month = datetimes['day'][0].split(' ')[1]
day = datetimes['day'][0].split(' ')[0]
datee = day+'-'+month
print((year,month,day))

('2012', 'Apr', '03')

In [ ]:
date_time_obj = datetime.datetime.strptime(date_time_str, '%Y-%m-%d %H:%M:%S.%f')